# ShowBraceBelow Property (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
StructuralSettings..::..ShowBraceBelow Property
StructuralSettings Class See Also
---
Whether to show brace symbols below beams in plan views.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)**Since:** 2011
# Syntax
C#
---
```text
public bool ShowBraceBelow { get; set; }
```

Visual Basic
---
```text
Public Property ShowBraceBelow As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool ShowBraceBelow {
	bool get ();
	void set (bool value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..DisabledDisciplineException | When setting this property: None of the following disciplines is enabled: Structural. |

# See Also
StructuralSettings Class
Autodesk.Revit.DB.Structure Namespace